app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "K8lS-ZMKlNJjjKVatzsXMA"], ["LIMIT", 1]]
---
	def self.random_code
		short_url = SecureRandom::urlsafe_base64
		while self.exists?(:short_url => short_url)

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "http://www.appacademy.io"], ["short_url", "K8lS-ZMKlNJjjKVatzsXMA"], ["user_id", 6], ["created_at", "2019-02-21 01:40:15.102305"], ["updated_at", "2019-02-21 01:40:15.102305"]]
---
	def self.create!(user, long_url)
		n = ShortenedUrl.new(user_id: user.id, long_url: long_url)
		n.short_url = ShortenedUrl.random_code
		n.save