app/models/visitor.rb

INSERT INTO "visitors" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 6], ["shortened_url_id", 8], ["created_at", "2019-02-21 02:00:17.112846"], ["updated_at", "2019-02-21 02:00:17.112846"]]
---
	def self.record_visit!(user, shortened_url)
		user_id = user.id
		shortened_url_id = shortened_url.id
		n = Visitor.new(user_id: user_id, shortened_url_id: shortened_url_id)
		n.save!